; domain
(define (domain matching-bw-typed)
(:requirements :typing)
(:types block hand)
(:predicates (hand-positive ?h - hand)
             (hand-negative ?h - hand)
             (block-positive ?b - block)
             (block-negative ?b - block)
             (clear ?b - block)
             (on-table ?b - block)
             (empty ?h - hand)
             (holding ?h - hand ?b - block)
             (on ?b1 ?b2 - block)
	     (solid ?b - block)
             (notsolid ?b - block)
)
(:action pickup
  :parameters (?h - hand ?b - block)
  :precondition (and (clear ?b) (on-table ?b) (empty ?h))
  :effect (and (holding ?h ?b) (not (on-table ?b)) (not (clear ?b))
               (not (empty ?h))))
(:action putdown-pos-pos
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-positive ?h) (block-positive ?b))
  :effect (and (empty ?h) (on-table ?b) (clear ?b)
               (not (holding ?h ?b))))
(:action putdown-neg-neg
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-negative ?h) (block-negative ?b))
  :effect (and (empty ?h) (on-table ?b) (clear ?b)
               (not (holding ?h ?b))))
(:action putdown-pos-neg
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-positive ?h) (block-negative ?b))
  :effect (and (empty ?h) (on-table ?b) (clear ?b) (not (solid ?b))(notsolid ?b)
               (not (holding ?h ?b))))
(:action putdown-neg-pos
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-negative ?h) (block-positive ?b))
  :effect (and (empty ?h) (on-table ?b) (not (solid ?b))(notsolid ?b) (clear ?b)
               (not (holding ?h ?b))))
(:action stack-pos-pos
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-positive ?h) (block-positive ?b))
  :effect (and (empty ?h) (on ?b ?underb) (clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))
(:action stack-neg-neg
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-negative ?h) (block-negative ?b))
  :effect (and (empty ?h) (on ?b ?underb) (clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))
(:action stack-pos-neg
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-positive ?h) (block-negative ?b))
  :effect (and (empty ?h) (on ?b ?underb) (not (solid ?b)) (notsolid ?b)(clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))
(:action stack-neg-pos
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-negative ?h) (block-positive ?b))
  :effect (and (empty ?h) (on ?b ?underb) (not (solid ?b)) (notsolid ?b)(clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))

(:action unstack
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (on ?b ?underb) (clear ?b) (empty ?h))
  :effect (and (holding ?h ?b) (clear ?underb) (not (clear ?b))
               (not (on ?b ?underb)) (not (empty ?h))))
)

; problem
(define (problem matching-bw-typed-n4)
(:domain matching-bw-typed)
(:objects h1 h2 - hand 
b1 b2 b3 b4  - block)
(:INIT 
(block-negative b3) 
(block-negative b4) 
(block-positive b1) 
(block-positive b2) 
(clear b1)
(clear b2)
(empty h1)
(hand-negative h2) 
(hand-positive h1) 
(holding h2 b4)
(notsolid b2)
(on b2 b3)
(on-table b1)
(on-table b3)
(solid b1)
(solid b3)
(solid b4)
)
(:goal (and

 (on b2 b1)
 (on b3 b4)))
)

; plan
1. (unstack h1 b2 b3)
   deleted: (clear b2) (on b2 b3) (empty h1)
   added: (holding h1 b2) (clear b3)
   goals met: 0 of 2
2. (putdown-neg-neg h2 b4)
   deleted: (holding h2 b4)
   added: (empty h2) (on-table b4) (clear b4)
   goals met: 0 of 2
3. (pickup h2 b3)
   deleted: (on-table b3) (clear b3) (empty h2)
   added: (holding h2 b3)
   goals met: 0 of 2
4. (stack-pos-pos h1 b2 b1)
   deleted: (clear b1) (holding h1 b2)
   added: (empty h1) (on b2 b1) (clear b2)
   goals met: 1 of 2
5. (stack-neg-neg h2 b3 b4)
   deleted: (clear b4) (holding h2 b3)
   added: (empty h2) (on b3 b4) (clear b3)
   goals met: 2 of 2
